"""
Напишите функцию hello, которая принимает на вход строку (имя) и выводит на экран фразу "Hello {имя}".
Вызовите написанную функцию.
"""

def hello_1(name):
    print(f"Hello {name}")


hello_1(name = "Tatsiana")
