"""
Дано число. Если оно положительно выведите yes, иначе no.
"""

n = int(input())
print("Yes" if n > 0 else "No")

