"""
Дано число. Если оно положительно - выведите positive, если отрицательно - negative, если равно нулю - zero.
"""

n = int(input())
print("positive" if n > 0 else 'negative' if n < 0 else 'zero')


