
"""
Напишите функцию hello_world, которая выводит строку 'Hello world!'. Вызовите эту функцию трижды.
"""
def hello_world():
    print('Hello world!')


if __name__ == '__main__':
    hello_world()
    hello_world()
    hello_world()
