
"""
Напишите функцию hello_world, которая выводит строку 'Hello world!'. Вызовите эту функцию трижды.
"""
def hello_world():
    print('Hello world!')


hello_world()
hello_world()
hello_world()
